In [13]:
salary_data = [('New Jersey',24,45000), ("Hawaii",36,70212), ("Maryland",49,83242), ("California",55,75277), ("Alaska",59,74346)]
spark_demo_df = spark.createDataFrame(salary_data, ['State', 'Age', 'Salary'])
spark_demo_df.createOrReplaceTempView('spark_demo_df')
spark_demo_df.show()

+----------+---+------+
|     State|Age|Salary|
+----------+---+------+
|New Jersey| 24| 45000|
|    Hawaii| 36| 70212|
|  Maryland| 49| 83242|
|California| 55| 75277|
|    Alaska| 59| 74346|
+----------+---+------+

In [14]:
%%sql
SHOW TABLES

In [15]:
%%sql
SELECT * FROM spark_demo_df

In [12]:
display(spark.sql('SELECT * FROM spark_demo_df'))